AR_WRITE SUBENTRY BASES=(3)

         WTO   'PRUEBA PARA ESCRIBIR UN ARCHIVO'
         
         OPEN  (ARCH,(OUTPUT))
         PUT   ARCH,REG
         CLOSE ARCH
         
FIN      WTO   'FIN'
         SUBEXIT

FINARCH  WTO   'FIN ARCHIVO'
         B     FIN

REG      DC    CL20'01234567890123456789'

ARCH     DCB   DDNAME=FILENAME,LRECL=20,RECFM=FT,MACRF=PM,EODAD=FINARCH
FILENAME DC    C'DATOS.DAT',X'00'

         END