RECORRER SUBENTRY BASES=(3)
         WTOR  'INGRESE VALOR MAXIMO',MAXC,,WAITECB
         WAIT  ECB=WAITECB
         PACK  DOBLE,MAXC     
         CVB   4,DOBLE
         
         
         SUBEXIT

MATRIZ   DC    400CL1'0'

VECTOR   DC    PL2'0'
VECVIS   DC    CL1

MAXC     DS    CL2

DOBLE    DS    FD

WAITECB  DC    F'0'

         END