CLSUNO   SUBENTRY BASES=(3)
         L     5,DIRDEST
         LA    4,ORIGEN
NEXT     CLC   0(1,4),=C'*'
         BE    FIN
         MVC   0(1,5),0(4)
         LA    4,1(4)
         LA    5,1(5)
         B     NEXT
FIN      MVI   0(5),C'#'
         ST    5,DIRFIN
         LR    6,5
         SUBEXIT
         
DIRDEST  DS    F
ORIGEN   DC    C'BLA*'
DESTINO  DS    CL50
DIRFIN   DS    F

         END