INICIO   SUBENTRY BASES=(3,4)
         WTO   'INICIANDO'
         WTO   MF=(E,VALOR_D-4)
FIN_P    WTO   'FIN'
         SUBEXIT

REG      DS    0CL2
REG_DEST DS    CL1
REG_PESO DS    PL1

CANT_REG DC    PL2'0'

         DC    H'6'
         DC    H'0'
VALOR_D  DC    C'CA'
         END